let loading= document.getElementById("loading");
let divContent=document.querySelectorAll(".col-md-6");
let divContentArray=[...divContent];
console.log(divContentArray)

let loadingPage=setTimeout(() => {
    
    loading.style.display="none";
    
 }, 1500);

 /**********************************************************************************/

 let curranyInfo = 
 [
     {
        defenation:"ما هو ال Bitcoin :",
        nameid:"bitcoin",
        Explain:`هي عملة مشفرة تم اختراعها في عام 2008 من قبل شخص أو مجموعة من الاشخاص الغير معروفة عرفت باسم ساتوشي ناكاموتو، بدأ استخدام العملة في عام 2009 عندما تم إصدار تطبيقها كبرنامج مفتوح المصدر. 
        بيتكوين هي أول عملة رقمية لامركزية، من دون وجود بنك مركزي، يمكن إرسالها من شخص إلى أخر عبر شبكة بيتكوين بطريقة الند للند دون الحاجة إلى وسيط طرف ثالث (كالبنوك)، يتم التحقق من حوالات الشبكة باسخدام التشفير ويتم تسجيلها في دفتر حسابات موزع يسمى سلسلة الكتل. يتم إنشاء البيتكوين كمكافأة لعملية تعرف باسم التعدين. ويمكن استبدالها بعملات ومنتجات وخدمات أخرى. تشير تقديرات البحوث التي تنتجها جامعة كامبريدج إلى أنه في عام 2017، هناك ما بين 2.9 إلى 5.8 مليون مستخدم يستعمل محفظة لعملة رقمية، ومعظمهم يستخدمون البيتكوين.
        تنتقد البيتكوين بسبب القدرة على استخدامها في اجراء معاملات غير قانونية، وبسبب الكمية العالية من الكهرباء المستخدمة للتعدين لانتاج كمية جديدة من البيتكوين، ولتقلب سعر الصرف، وللاختراقات بورصات التداول بالبيتكوين. ووصفها بعض الاقتصاديين بأنها فقاعة مضاربية. 
        شبكة البيتكوين تعمل منذ 2009 ولم تتوقف منذ ذلك الحين، وبسبب نظام الاجماع في العملة لم يستطع أحد اختراق سلسلة كتل البيتكوين، ومعظم الاختراقات اللتي يتتم هي بسبب اخطاء ببشرية في إدارة المحفظة وليست بسبب عيوب في التصميم.
        <br><br>
        <h4>النشأة</h4>
        
        طرح شخص أطلق على نفسه الاسم الرمزي ساتوشي ناكاموتو فكرة بيتكوين للمرة الأولى في ورقة بحثية في عام 2008، ووصفها بأنها نظام نقدي إلكتروني يعتمد في التعاملات المالية على مبدأ الند للند ، وهو مصطلح تقني يعني التعامل المباشر بين مستخدم وآخر دون وجود وسيط كالتورنت. يقول القائمون على بيتكوين إن الهدف من هذه العملة التي طرحت للتداول للمرة الأولى سنة 2009 هو تغيير الاقتصاد العالمي بنفس الطريقة التي غيرت بها الويب أساليب النشر.
        <br><br>
        <h4>أول صفقة شراء بواسطة بتكوين</h4>
        
        أول عملية شراء تمت بواسطة بتكوين، كانت مقابل قطعتان بيتزا، حينما قام مبرمج يدعى لازلو هانيتش بنشر نقاش على منتدى بتكوين يطلب فيه شراء قطعتين بيتزا كبيرتا الحجم مقابل 10,000 بتكوين في 18 مايو 2010، بعد 11 عام على تلك الصفقة تجاوزت قيمة الـ 10,000 بتكوين التي تم دفعها مقابل قطعتا البيتزا $318000000.
        <br><br>
        <h4>هوية ساتوشي</h4>
        
        في عام 2016 أعلن رجل الأعمال الأسترالي كريغ رايت أنه هو ساتوشي ناكاموتو مقدما دليلا تقنيا على ذلك ولكن تم كشف زيف أدلّته بسهولة.
        <br><br>
        <h4>وحدة الحساب</h4>
        
        وحدة الحساب في نظام البيتكوين هي عملة البيتكوين. رمز التداول المستخدم لتمثيل البيتكوين هو BTC و XTC ورمز يونيكود المستخدم هو ₿. الوحدات البديلة للكميات الصغيرة من البيتكوين هي ميليبيتكوين برمز (mBTC) وساتوشي برمز (sat). تم تسمية الوحدة sat تكريماً تكريما لمنشئ العملة وهو satoshi، وهي أصغر قيمة في نظام بيتكوين ومثل 1⁄100000000 بيتكوين، أي مائة مليون من بيتكوين. الملي بيتكوين يساوي 1⁄1000 بيتكوين ؛ واحد على ألف من عملة البيتكوين أو 100,000 ساتوشي.
        `,
        image_url:"images/Bitcoin.jpg"
     }
     ,
     {
         defenation : "ماهو الإثيريوم؟",
         nameid:"الإثيريوم",
         Explain:`<h4 style="line-height:1.5">يعتبر إيثريوم هو الأساس لعصر جديد من الإنترنت:</h4>
         •	الإنترنت حيث يتضمن النقود والمدفوعات.
         <br>
         •	الإنترنت حيث يمتلك المستخدمون بياناتهم, وتطبيقاتك لا تتجسس عليك أو تسرق منك.
         <br>
         •	الإنترنت حيث يمكن للجميع الوصول إلى نظام مالي مفتوح.
         <br>
         •	الإنترنت القائم على بنية تحتية محايدة متاحة الوصول، لا تتحكم فيها أي شركة أو شخص.
         <br>
         تم إطلاق إيثريم في عام 2015، ويعد سلسة الكُتل الرائدة عالميًا.
         كغيرها من سلاسل الكُتل، فإن إيثريوم لديها عملة مشفرة أصلية تسمى إيثر (ETH). ETH هي نقود رقمية. إذا سمعت عن بيتكوين ، فإن ETH تتميز بالعديد من الميزات نفسها. إنها رقمية بشكل كامل، ويمكن إرسالها إلى أي شخص في أي مكان في العالم على الفور. لا يتم التحكم في إمدادات ETH من قبل أي حكومة أو شركة - إنها لا مركزية، و نادرة. يستخدم الناس في جميع أنحاء العالم ETH لإجراء المدفوعات، أو كحفظ للقيمة، أو كضمان.
         ولكن على عكس سلاسل الكُتل الأخرى، يمكن لإيثريوم عمل الكثير. إيثريوم قابلة للبرمجة، مما يعني أنه يمكن للمطورين استخدامها لإنشاء أنواع جديدة من التطبيقات.
         تكتسب هذه التطبيقات اللامركزية (أو "dapps") فوائد تقنية من العملات الرقمية و سلاسل الكُتل. يمكن أن تكون جديرة بالثقة، مما يعني أنه بمجرد "تحميلها" إلى إيثريوم، فإنها ستعمل دائمًا كما تم برمجتها. يمكنهم التحكم في الأصول الرقمية من أجل إنشاء أنواع جديدة من التطبيقات المالية. يمكن أن تكون لا مركزية، مما يعني أنه لا يوجد كيان أو شخص واحد يتحكم فيها.
         <h4 style="line-height:1.5">في الوقت الحالي، يقوم الآلاف من المطورين في جميع أنحاء العالم بإنشاء تطبيقات على إيثريوم، ويقومون بابتكار أنواع جديدة من التطبيقات، يمكنك استخدام الكثير منها اليوم:</h4>
         •	محافظ العملات الإلكترونية والتي تسمح بدفع رخيص ومباشر بعملة إيثر او اصول اخرى
         <br>
         •	التطبيقات المالية التي تتيح لك استعارة أصولك الرقمية أو إقراضها أو استثمارها
         <br>
         •	أسواق لامركزية ، تتيح لك تداول الأصول الرقمية، أو حتى تبادل "التوقعات" حول الأحداث في العالم الحقيقي
         <br>
         •	الألعاب والتي تمتلك فيها أصولًا داخل اللعبة، ويمكنك حتى كسب أموال حقيقية
         <br>
         •	والكثير جدًا.
         <br>
         مجتمع إيثريوم هو مجتمع سلاسل الكُتل الأكبر والأكثر نشاطًا في العالم. ويشمل مطورو البروتوكول الأساسي، والباحثين في مجال الاقتصاديات المشفرة، وCypherpunks ، ومؤسسات التعدين، وحاملي ETH، ومطوري التطبيقات، والمستخدمين العاديين، والأناركيين، وقائمة فورتشين 500، وفي الوقت الحالي، أنت.
         لا توجد شركة أو مؤسسة مركزية تسيطر على إيثريوم. يتم الحفاظ على إيثريوم وتحسينه بمرور الوقت من قبل مجتمع عالمي متنوع من المساهمين الذين يعملون على كل شيء من البروتوكول الأساسي إلى تطبيقات المستهلك. تم بناء هذا الموقع، تمامًا مثل بقية إيثريوم، تم بناؤه - ومازال - بواسطة مجموعة من الأشخاص الذين يعملون معًا.
         `,
         image_url:"images/Ethereum.jpg"
     }
     ,
     {
         defenation : "ما هي عملة  Binance Coin BNB  :",
         nameid:"Binance Coin BNB",
         Explain:`عملة بينانس كوين يرمز لها بالرمز BNB تديرها منصة بينانس التي أطلقتها كعملة رسمية لها تقوم بمنح تخفيضات تداولية على المنصة لحامليها وذلك بفضل نظام النسبي الذي أقرته منصة بينانس والمتمثل في تخفيض بنسبة 50% العام الأول و 25% في العام الثاني وتبقى تنقسم لنصف النسبة كل سنة.
         تعد العملة حاليا من ضمن العملات الرقمية المشفرة الكبيرة من حيث حجم التداول ومن حيث حجم القيمة السوقية الاجمالية.
         تحتل العملة في الوقت الحالي المرتبة السابعة بقيمة 30 دولار للوحدة بقيمة سوقية اجمالية تقدر بـ4.3 مليار دولار.
         العملة أطلقت في أول الأمر على بلوكشين الايثيريوم بمعيار ERC20 قبل أن تتحول مؤخرا نحو شبكة بينانس الخاصة.
         <h4>مميزات عملة   Binance Coin BNB :</h4>
         بالاضافة إلى ميزة التخفيضات التي اشرنا إليها في وقت سابق والتي تسمح بتخيض رسوم التداول هناك العديد من ميزات عملة BNB هي كما يلي:
         حرق مقدار معين من العملة بشكل سنوي لزيادة ندرتها وبذلك زيادة قيمتها حيث أحرقت منصة بينانس مؤخرا ما قيمته 5 مليون وحدة. BNB 
         التوافق مع معيار ERC20 وبذلك امكانية تخزين العملة في محافظ تدعم هذا البروتوكول.
         توفر عملة BNB وبشكل حصري امكانية الدخول على الاكتتابات التي تعرض على منصة بينانس لونشباد وتفرض المنصة التوفر على قدر معين منها كشرط من شروط الدخول على قرعة الاكتتاب.
         توسع استخدام عملة BNB على منصات مختلفة إذ يمكن بواسطة العملة شراء سلع وخدمات مختلفة بالاضافة إلى إمكانية حجز الفنادق وغيرها من الأمور والحاجيات اليومية.
         الدعم المباشر من أكبر منصة تداولية في العالم.
         التوفر على قدر محدود من العملة والمقدر بـأقل من 190 مليون دولار.
         كانت هذه أبرز مميزات عملة BNB التي عرفت في الأسبوع قبل الماضي ارتفاع صاروخي وتاريخي في قيمتها أين وصلت لقيمة 35 دولار.
         `,
         image_url:"images/BinanceCoin.png"
     }
     ,
     {
         defenation : "كريبتو لايت – نشأة كاردانو Cardano:",
         nameid:"Cardano",
         Explain:`تم إطلاق كاردانو Cardano من قبل تشارلز هوسكينسون، أحد مؤسسي إيثريوم Ethereum السابقين، في أيلول/ سبتمبر 2017. ونجحت في الوصول قائمة العملات الرقمية المشفرة العشر الأولى، وتحتل حالياً المركز التاسع بقيمة سوقية تبلغ 1.88 مليار دولار وبسعر 0.0726 دولار للوحدة حسب موقع كوين ماركت كاب Coin Market Cap. وهي تعتمد على “بلوكشين Blockchain” مفتوح المصدر تماماً، ويقدم منصة لمشاريع التطبيقات اللامركزية والعقود الذكية، مثل إيثريوم Ethereum.
         <h4 style="line-height:1.5">ما هي كاردانو Cardano:</h4>
         كاردانو Cardano هي موطن عملة ADA التي يمكن استخدامها لإرسال واستقبال الأموال الرقمية بطريقة آمنة للغاية. لكن كاردانو Cardano هي أكثر من مجرد عملة رقمية مشفرة.
         أجرى فريق Cardano شراكة مع بعض من أفضل الجامعات في العالم، مثل جامعة إدنبره ومعهد طوكيو للتقنية، وذلك لضمان أن منصتهم مبنية على أساس بحثي مدقق من قبل النظراء.
         تتمثل رؤية كاردانو Cardano في إنشاء منصة للتطبيقات اللامركزية والعقود الذكية التي يمكن معالجتها بتقنية تسمى التحقق الرسمي. يتم كتابة معظم التعليمات البرمجية بشكل غير رسمي ويتم تقييمها بشكل أساسي حول ما إذا كانت تعمل أم لا. من ناحية أخرى، يمكن اختبار البرنامج الذي تم التحقق منه بشكل رسمي بنفس درجة اليقين التي يثبت بها علماء الرياضيات النظريات، والكود يقرأ بالفعل كدليل رياضي.
         تستخدم Cardano خوارزمية إجماع على إثبات الملكية PoS أنشأوها بأنفسهم، تسمى Ouroboros.  تعتبر أنظمة إثبات الملكية أكثر كفاءة في استخدام الطاقة بشكل كبير ولها معدلات معاملات أسرع من إثبات العمل PoW. في حين أن إثبات الملكية يحمل العديد من الفوائد، إلا أنه للأسف يصعب تطويره بطريقة آمنة. تستخدم معظم منصات “بلوكشين Blockchain”، بما في ذلك بيتكوين Bitcoin و إيثريوم Ethereum، خوارزميات إثبات العمل.
         لكن كاردانو Cardano تمكنوا من حل هذه المشكلة الأمنية … ويمكنهم إثبات ذلك. يأتي Ouroboros مع إثبات رياضي للأمن تم استعراضه بدقة من قبل النظراء، مما أدى إلى قبوله وعرضه في مؤتمر التشفير Crypto 2017،
         ستنمو كاردانو Cardano تدريجيا لتقديم المزيد والمزيد من الميزات، بما في ذلك العقود الذكية، والسلاسل الجانبية، والحسابات متعددة الأطراف، والبيانات الوصفية. يمكننا أن نتوقع رؤية إطلاق بعض هذه الميزات خلال النصف الأول من عام 2018.
         `,
         image_url:"images/Cardano.jpg"
     }
     ,
     {
         defenation : "ما هي عملة الدوجكوين (Dogecoin) :",
         nameid:"Dogecoin",
         Explain:`عملة الدوجكوين (Dogecoin) ورمزها XDG هي عبارة عن عملة رقمية تم الإعلان عنها في نهاية عام 2013، وقد ظهرت وشعارها يحمل نوع من أنواع الكلاب لذلك سميت بعملة الكلب الإلكترونية. هذه العملة الرقمية مثلها مثل أي عملة رقمية لا وجود لها على أرض الواقع أي لا يمكن لمسها أو إستخدامها في الأماكن العادية لأنها عملة أفتراضية مفتوحة المصدر غير مركزية تتميز بسرعة إنتاج عالية تفوق كل العملات الأخرى، كما ان هذه العملة لا توجد شركة معينة منتجة لها أو هيئة تنظيمية تقف خلفها، ولكنها نجحت وحجزت لها مكان بين العملات الرقمية الكبرى والرائدة بحيث أصبح من الممكن إستخدامها كأي عملة رقمية للشراء والبيع عبر الإنترنت كما يمكن تحويلها الى عملة تقليدية على أرض الواقع.
         تعتبر عملة الدوجكوين (Dogecoin) أيضًا عملة سهلة سلسة في التعامل عن العملات الأكثر سهولة مثل البيتكوين لعديد من الأسباب وأهمها:
         <br><br>
         •	جمع البيتكوين أصبح أمر صعب الى حد ما.
         <br><br>
         •	البيتكوين في حالة إرتفاع متواصل حيث وصل الى 10.000 دولار حاليًا أو أكثر.
         <br><br>
         •	البيتكوين صعب التعدين في ظل الظروف الحالية.
         <br><br>
         هذا كله يؤشر لإحتلال العديد من العملات الرقمية محل البيتكوين وعلى رأسهم الدوجكوين وذلك لأن عملة الدوجكوين الافتراضية عملة رخيصة جدًا مقارنة بغيرها من العملات حيث يبلغ سعرها على ما يقارب 2.5 دولار لكل ألف دوجكوين، وكما ان عملة البيتكوين الواحدة تساوي أكثر من 4 ملايين من قطعة الدودجكوين.
         وهذا يعني إنه يمكنك الإستثمار فيها دون الحاجة الى رأس مال ضخم كما إن تعدينها سهل ومتاح مقارنة بغيرها من العملات. على الرغم من ذلك تشير المؤشرات والتحليلات الى إرتفاع سعرها في ظرف سنة فقد تصل الى دولار لكل دوجكوين (XDG) وهذا بناء على التحليلات والمؤشرات لسوق تداول رأس المال.
         <h4 style="line-height:1.5">مدى الربح من الدوجكوين (Dogecoin)</h4>
        بالنظر الى الأرقام السابقة يمكنك جمع الدوجكوين رغبة في الربح المستقبلي بعد إرتفاع سعرها فمثلًا إذا قمت بشراء 100 ألف قطعة من الدوجكوين ستدفع 250 دولار فقط حاليًا، ثم بعد ذلك قمت ببيعها عندما يكون الدوجكوين وصل الى 1 دولار تكون قد ربحت 100 ألف دولار وهو رقم خيالي عن طريق إستخدام طريقة سهلة فيمكنك جمع هذه العملات عن طريق شرائها أو تعدينها كما يمكنك الحصول عليها عن طريق الحظ من بعض المواقع الشهيرة لربح العملة خلال كل ساعة.
        <h4 style="line-height:1.5; margin-top:10px">طريقة جمع عملة الدوجكوين (XDG)</h4>
        لجمع عملة الدوجكوين لا بد من إتخاذ بعض الخطوات الجيدة للوصول الى هذه العملة أو تعدينها أهم هذه الخطوات:
        <br><br>
        •	فتح محفظة لجمع عملة الدوجكوين وتعتبر محفظة dogechain أفضل محفظة.
        <br><br>
        •	نسخ عنوان محفظتك للبدء في تعدين وجمع عملة الدوجكوين.
        <br><br>
        •	يمكنك إستخدام التطبيق الأمثل وهو free doge coin حيث يقوم بمنح أي عميل واحد دوجكوين كل ساعة عند الدخول إليه وتنفيذ الخطوات وبالتالي فهو التطبيق الأفضل.
        <br><br>
        •	يوجد العديد من المواقع المتخصصة لعملة الدوجكوين يمكن العمل من خلالها، كما يمكن البحث عن وسيط حيث يوجد الكثيرين من يهتموا بترويج للعملة والإستفادة منها.
         `,
         image_url:"images/Dogecoin.jpg"
     }
     ,
     {
         defenation:"عملة تيثر Tether الرقمية:",
         nameid:"Tether",
         Explain : `عملة Tether ورمزها (USDT) هي عملة رقمية تقوم على تحويل العملات النقدية المتعارف عليها مثل اليورو أو الدولار وغيره إلى عملة رقمية من خلال وجود بروتكول “Omni Layer” في المنصة المتداول عليها وهي غالبًا تكون في منصة بولونكس أو بتركيس، وهي متوافرة ضمن سلة العملات في منصات تداول العملات الرقمية ويطلق عليها رمز USDT.
         <h4 style="line-height:1.5">كيف تعمل عملة تيثر المشفرة (Tether (USDT</h4>
         الفائدة القصوى من هذه العملة هي عندما تشعر أن العملة الرقمية التي تتداول عليها بإستمرار مثل البيتكوين أو الإيثريوم أو غيرها لديها مؤشر الانخفاض وتحتاج إلى تحويلها إلى عملة بديلة ثابتة القيمة حتى لا تتعرض إلى الخسارة وقد لا تجد من يشتري منك هذا الكم الهائل من العملة في ظل وجود مؤشرات الانخفاض، لن تجد أفضل من تجميد هذه العملة عند السعر المرتفع لها وهنا يبرز دور هذه العملة، فيمكن تحويلها إلى Tether (USDT) فهي عملة ثابتة سعرها لا يتغير بسعر السوق ولا تتأثر بأي تغييرات قد تطرأ وبالتالي سوف تحافظ على قيمة العملة الفعلية التي كانت في محفظتك لحين استقرار سعرها كما يمكنك تحويلها مرة أخرى، وقد يؤدي هذا التجميد إلى مكاسب هائلة.
         عملة تيثر Tether مدعومة بشكل فعلي بالدولار الأمريكي قيمتها الحقيقة هي دولار واحد لكل عملة، وبالتالي لن يحدث أي تغييرات عليها ما دام رصيد الدولارات الأمريكية موجود بالفعل في خزينة الموقع، أي أن هذه العملة ثابتة القيمة ولا تتغير ولا تتأثر بتغييرات السوق.
         <h4 style="line-height:1.5">سبب إطلاق عملة تيثر الإلكترونية</h4>
         السبب الرئيسي لإنشاء عملة Tether وعملات عديدة من تيثرTether هو تسهيل تحويل العملات الرقمية المختلفة المهددة بالإنهيار إلى بديل مستقر ومدعوم من قبل كيانات كبرى ويمتاز بالشفافية العالية ويمكن التأكد من وجوده في أي وقت، كما ساعد وجود عملة مستقرة على وجود بدائل لعمليات الصرف والمحفظات الإلكترونية الغير مستقرة وبالتالي وجود أموال وتداولات العملاء في آمان لكل من يستخدمها.
         <h4 style="line-height:1.5">كيفية التحقق من صدق عملة Tether</h4>
         تقوم شركة “Tether Limited” بشكل مستمر بنشر الحساب البنكي الخاص بها والرصيد المتاح من عملة USDT وما يقابلها من الدولار الأمريكي أو أكثر حتى يتم التحقق بشكل شخصي من قبل كل مستثمر قبل التحويل إلى هذه العملة من الموقع الخاص بالشركة وهو (Transparency) ، فلابد وأن يتناسب المبلغ الموجود في الشركة من عملة USDT مع مبلغ الدولار الأمريكي، ويقوم المهنيون والمحترفون بالتأكد من هذه الكمية المتناسبة بشكل مستمر، لذا لا حاجة أن يقلق المستثمر عند تحويل محفظته المالية من أي عملة مثل البيتكوين أو اللايتكوين أو غيرها إلى محفظة بها عملة USDT وذلك لأن هذه العملة تعتبر الأمثل لأي فرد، فعند التفكير لتغيير العملة الرقمية المتداول عليها إلى أي عملة أخرى لا تختار إلا عملة USDT حيث إنك لو قمت بتغيير العملة من البيتكوين مثلًا إلى الإيثريوم ستتعرض إلى الخسارة بالطبع لأنه ما دام السوق تغير فكل العملات سعرها سوف يتغير، ولكن إذا قمت بتغييرها إلى USDT فأنت اخترت العملة الأفضل حيث أن هذه العملة لا تتغير فهي مدعومة بالدولار الأمريكي وقيمتها نفس قيمته لذا فهي نظام آمن للجميع وله العديد من المميزات.
         <h4 style="line-height:1.5">مميزات عملة تيثر الرقمية Tether (USDT)</h4>
         المدير التنفيذي لمنصة التداول العالمية المعروفة بإسم Bitfinex هو المدير التنفيذي لشركة Tether التي تصدر عملة تيثر USDT الرقمية المدعومة بالدولار وقيمتها نفس قيمة الدولار، والعجيب أن شركة Tether الداعمة لهذه العملة تقدم وسيلة امتلاك العملة أو نقلها عبر منصات التداول الرقمية المختلفة دون الحاجة إلى تحويل العملة الرقمية الى أصول حقيقية من الدولار، وبالتالي فكل عمليات التحويل تثير بسلاسة طالما الاحتياطي من العملة متاح في المنصات. اليكم أهم المميزات لهذه العملة المشفرة:
         <br>
         1.	هي عبارة عن واحدة من العملات المشفرة التي تصدر من نظام البلوكشين الخاص بعملة البيتكوين.
         <br>
         2.	تستخدم بروتكول خاص بها يطلق عليه “Omni Layer” بعكس العملات الرقمية الأخرى والتي تتوقف على الخوارزميات الرياضية المعقدة وتحتاج إلى حلول لتعدينها.
         <br>
         3.	كل وحدة تيثر USDT تعادل دولار أمريكي.
         <br>
         4.	يتم الاحتفاظ بالرصيد الخاص بالعملة في رصيد الاحتياطي الخاص بالشركة الداعمة لهذه العملة وهي (Tether Limited).
         <br>
         5.	يمكن نقل هذه العملة وتحويلها إلى أي عملة، كما يمكن صرفها كما هي من خلال أي محفظة “Omni Layer” تكون مفعلة.
         <br>
         6.	هو نظام آمن ويمتاز بالشفافية بالعالية في التعامل حيث يتم نشر الاحتياطي منها بشكل مباشر وسريع.
         <br>
         7.	يمنح المتعاملين أسعار ثابتة الأصول للعملات المحلية المختلفة.
         <br>
         8.	المعاملات بينها وبين أي عملة رقمية مشفرة تعتبر سهلة ورخيصة ولا تصادفها أي مشاكل.
         <br>
         9.	تعتبر من أكثر العملات الرقمية إستقرارًا وذلك لدعم الدولار إليها.
         <br>
         عملة تيثر أو USDT من العملات الرقمية المشفرة مثلها مثل أي عملة مع فارق إنها مدعومة بالدولار فتمتاز بالاستقرار عن أي عملة أخرى، كما يمكن التحقق من وجود احتياطي كافي من هذه العملة على المنصة المتداوَل عليها من خلال معرفة عدد العملة، لذا عند الاضطرار لتغيير عملتك الرقمية لا تختار أي عملة بدون معرفة مستقبلها، بل إختر عملة Tether لما لها من مستقبل، إستقرار وثبات، فكما كان الدولار الأمريكي في القديم مدعومًا بالذهب وكان الاحتياطي الموجود من الذهب يضمن استقرار الدولار، هو نفس الحال مع هذه العملة فهي مدعومة بالدولار والاحتياطي الموجود منه يدعم وجود العملة بشكل قوي لذا احرص إن تكون لديك محفظة موجود بها العملة الرقمية Tether USDT العملة الأكثر ثباتًا حتى تحمي تداولاتك من الخسائر.
         `,
         image_url:"images/Tether.jpg"
     }
     ,
     {
         defenation : " ما هي عملة الريبل؟",
         nameid:"XRP",
         Explain:`الريبل XRP هوعملة رقمية مشفرة صُممت للاستخدام على شبكة الريبل من أجل تحويل الأموال بسرعة بين التجار والمشترين الذين يستخدمون عملات مختلفة.
         قامت شركة ريبل لابز- وهي شركة تكنولوجيا أمريكية - بإنشاء شبكة الريبل كمنصة تستخدمها البنوك والمؤسسات المالية في تحويل الريبل على المستوى الدولي بسرعة وبسعر أقل. يمكن للتجار، ومتلقي الأموال، والبنوك تحويل عملتهم المحلية إلى ريبل، وإرسال العملات المحلية إلى جِهة محلية، وإعادة تحويل الريبل إلى العملة التي يقبلها التاجر.
         يؤدي هذا إلى تقليل كلًا من أوقات التحويل والرسوم على البنوك التي قد لا تكون لها علاقة مباشرة مع مؤسسة أجنبية، طالما أن كلاهما على شبكة الريبل.
         <h4 style="line-height:1.5">كيف يعمل الريبل؟</h4>
         
         تقوم شبكة الريبل على أجهزة كمبيوتر مستقلة حول العالم لمراقبة تاريخ كل عملة من خلال الاحتفاظ بسجل للمعاملات، وهذا مشابه لآلية عمل العملات الرقمية الأخرى، مثل البتكوين و الإيثيريوم.
         ونظرًا لأنه لا يتم الاحتفاظ بهذا السجل في موقع مركزي، فإن هذا السجل يسمى نظام السجل اللامركزي. يسمح هذا النظام اللامركزي بزيادة الشفافية التي تعتمد عليها البنوك في إرسال الريبل إلى المؤسسات المالية المسجلة الأخرى حول العالم، فالآن تتمتع البنوك بمزايا شبكة مالية أكبر ربما لم تكن تمتلكها في الماضي.
         على سبيل المثال، إذا أراد تاجر في براغ بيع سلعة أو خدمة بعملة الكورونا التشيكية (CZK) لشخص يستخدم الدولار النيوزيلندي (NZD) قد لا يكون هناك بنوك في هذه البلدان لها علاقة مباشرة مع بعضها بعضًا فقد، كانت الطريقة التقليدية لتحويل الأموال تتمثل في إرسال الأموال عبر شبكة من البنوك، تُضيع الوقت وتتقاضى رسوم على طول الطريق.
         يُتيح الريبل للبنك أو 'البوابة' تبسيط العملية عن طريق تغيير العملة المحلية لمن يقوم بالدفع إلى عُملة الريبل الرقمية. يمكن بعد ذلك تغييرها مرة أخرى إلى العملة المحلية للتاجر في غضون ثوانٍ فقط عندما تصل إلى بوابة المستلم، أو يتم الاحتفاظ بها بعملة الريبل.
         
         <h4 style="line-height:1.5">إلى أي مدي الريبل مفتوح المصدر؟</h4>
         إن شبكة الريبل هي الشبكة الرئيسية للتواصل بين البنوك العالمية والمؤسسات المالية. فهُم يستخدمون هذه المنصة لتحويل الأموال بسهولة إلى كل أنحاء العالم باستخدام عملة شبكة الريبل.
         تضع شركة ريبل لابز- التي تُدير الشبكة - البروتوكولات، وهذا المؤسسات المالية في تقليل أوقات المعالجة، وضمان شفافية البروتوكول، والإبلاغ عن الأنشطة المشبوهة مثل غسيل الأموال. في حين أن المدققون يعملون بشكل مستقل، إلا أن عمليات شبكة الريبل مركزية وليست مفتوحة للمطورين.
         تقدَّم ريبل لابزى إصدارًا مفتوح المصدر من برامجها للمطورين الذين يرغبون في دمج مدفوعات الريبل في برامجهم وتطبيقاتهم. هذه الخدمة تُسمى ريبل إكس، وبها جوانب مفتوحة المصدر.
         تركز خدمات ريبل الرئيسية - على خلاف العملات الرقمية الأخرى- على التحويلات الدولية السريعة للعملات. هذا يعني أنه بينما تعتمد شبكاتهم على سجل لامركزي ومُصدقين نشطين، مازالوا يحتفظون بالسيطرة على كيفية استخدام الشبكة لضمان الثقة في نظامهم الأساسي.
         
         <h4 style="line-height:1.5">مصطلحات الريبل</h4>
         •	RTXP - بروتوكول معاملات الريبل.<br>
         •	المركزية - هي هيئة مركزية تنظيمية، مثل ريبل لابز، التي تضع قوانين للشبكة.<br>
         •	الإجماع - عندما يوافق أكثر من 80٪ من المدققين على الصفقة. وهذه ميزة كبيرة عن تقنيات البلوكتشين الأخرى.<br>
         •	اللامركزية - هو نظام يعمل بدون هيئة فردية تسيطر على أصحاب المصلحة أو المشغلين.<br>
         •	الدروب - أصغر وحدة في الريبل. هي عبارة 6 نقاط عشرية وتم تعريفها على أنها توقف البريد العشوائي المحتمل، أو المعاملات غير المرغوب فيها على الشبكة.<br>
         •	البوابة - هي مكان لتحويل العملة المحلية إلى ريبل، أو لتحويل الريبل إلى العملة المحلية. يمكن أن تكون البوابة بنوك ومؤسسات المالية وغيرها.<br>
         •	التعدين - عمليات التحقق من المعاملات للعملة الرقمية. وهذا غير متوفر على شبكة الريبل.<br>
         •	العقدة - مدقق معترف به على شبكة الريبل.<br>
         •	المصدر المفتوح - برنامج كمبيوتر أو جزء منه يُتاح الكود الخاص به للمطورين مع إمكانية تغيير أقسام الكود حسب الحاجة.<br>
         •	شبكة الريبل - هي منصة برمجية للبنوك والمؤسسات المالية للوصول إلى الريبل.<br>
         •	ريبليكس - هي منصة مفتوحة المصدر تسمح للمطورين بإضافة نظام الدفع بالريبل إلى تطبيقاتهم.<br>
         •	قائمة العُقدة المُميزة (UNL) - هي قائمة من المدققين الموصى بهم على شبكة الريبل المقدمة من شركة ريبل لابز. المدققون - أجهزة كمبيوتر مستقلة تدير سجلات الريبل وتؤكد المعاملات.<br>
         •	الريبل - هي العملة الصادرة عن شركة ريبل لابز.<br>
         •	سجل الريبل -هو سجل يحتفظ بتاريخ معاملات كل عملة.
         `,
         image_url:"images/XRP.jpg"
     }
     ,
     {
         defenation : "ما هي Polkadot $ DOT :",
         nameid:"Polkadot $ DOT",
         Explain:`تأسست Polkadot على يد روبرت هابرميير والدكتور جافين وود وبيتر زابان وهي مدعومة من مؤسسة Web3 وكذلك Parity Technologies.
         بدأ تطوير Polkadot في نوفمبر 2017 عندما نشر المطورون الكود الأول على Github. في يوليو 2018، وفي مايو 2020 ، أطلقت Polkadot في حالة “أولية”.
         اعتبارًا من أكتوبر 2020 ، لم يتم تنشيط سلسلة Relay Chain الخاصة بـ Polkadot ولم يتم تفعيل مزادات Parachain بعد.
         العودة إلى مؤسسي Polkadot:
         روبرت هابرماير هو زميل في Thiel ومؤسس مشارك في Polkadot. إنه عضو قديم في مجتمع Rust ولديه خلفية بحث وتطوير واسعة في سلاسل الكتل والأنظمة الموزعة والتشفير.
         الدكتور جافين وود ليس فقط مؤسس Polkadot ، ولكنه أيضًا مؤسس Ethereum و Parity Technologies و Grid Singularities و Web3 Foundation. إنه من أشد المؤيدين لفضاء بلوكشين حيث اخترع العديد من مكونات بلوكشين الأساسية بما في ذلك Solidity وإثبات السلطة وإجماع Whisper.
         بيتر كزابان هو مدير التكنولوجيا لمؤسسة Web3 ومؤسس Polkadot. لقد تلقى تعليمًا عاليًا وحصل على درجة الماجستير في الهندسة من جامعة أكسفورد ولديه مجموعة متنوعة من الخبرة العملية عبر صناعات الدفاع والتمويل وتحليلات البيانات ، والعمل على الشبكات المتداخلة ، وقواعد المعرفة الموزعة ، ونماذج التسعير الكمي ، والتعلم الآلي ، و تطوير الاعمال.
         علاوة على ذلك ، وبغض النظر عن هؤلاء المؤسسين الرئيسيين ، فإن Polkadot هو المشروع الرئيسي لمؤسسة Web3 ، وهي مؤسسة سويسرية تأسست لتسهيل شبكة لامركزية تعمل بكامل طاقتها وسهلة الاستخدام.
         `,
         image_url:"images/Polkadot.jpeg"
     }
     ,
     {
         defenation : "ماهو مشروع “Internet Computer”؟",
         nameid:"Internet Computer",
         Explain:`مشروع “Internet Computer” أو كمبيوتر الانترنت هو أول شبكة عامة لامركزية في العالم ذات سعة غير محدودة أنشأتها مؤسسة “DFINITY” التي سبق وتطرقنا لها في بيتكوين العرب في مقالة بعنوان:
         مشروع الكريبتو “Dfinity” المُقيم بأكثر من 10 مليار دولار يطلق تحديث جديد
         تتمثل مهمة وهدف المشروع في توفير خدمات الانترنت العامة والسماح باستضافة البرامج على الشبكة.
         تساعد منصة الحوسبة السحابية اللامركزية مطوري البرامج على مشاركة أطر برامجهم مفتوحة المصدر بحرية على الإنترنت دون الاعتماد على عمالقة التكنولوجيا مثل أمازون وفيسبوك، أو الخوادم والخدمات السحابية التجارية.
         
         <h4 style="line-height:1.5">ما هي العملة الرقمية ICP؟</h4>
         تعمل العملة الرقمية المشفرة (ICP) على بروتوكول خاص بها يسمى “Internet Computer”.
         الهدف من العملة تأسيس حوكمة البروتوكول وتسهيل معاملات الشبكة.
         باستخدام العملة الرقمية ICP، يمكن لحاملي العملة التصويت على مقترحات إدارة المشروع.
         وظيفة أخرى للعملة هي دفع رسوم المعاملات.
         مقارنة بشبكة الايثيريوم الحالية، فإن رسوم ICP تتميز بسعر ثابت للمعاملات.
         
         <h4 style="line-height:1.5">مؤسسة “DFINITY”:</h4>
         مؤسسة “DFINITY” هي منظمة غير ربحية، تأسست في عام 2016 من قبل “دومينيك ويليامز”، يتخذ المشروع من “زيورخ” – سويسرا مقرا له.
         هدف المشروع هو تحويل الانترنت إلى منصة حوسبة عامة لامركزية.
         أنشأت “DFINITY” حاليا ثلاثة مراكز بحثية على مستوى العالم، وقد قام الفريق بتوظيف أكثر من 100 باحث ومهندس وفرق للعمليات.
         منذ عام 2015، حاز هذا المشروع على استحسان المستثمرين المشهورين مثل:
         <br>
         •	Andreessen Horowitz (A16Z).<br>
         •	PolychainCapital.<br>
         •	SVAngel.<br>
         •	AspectVentures.<br>
         •	VillageGlobal.<br>
         •	MulticoinCapital و ScalarCapital…<br>
         `,
         image_url:"images/InternetComputer.jpg"
     }
     ,
     {
         defenation : "ما هو البيتكوين كاش Bitcoin Cash او BCH :",
         nameid:"Bitcoin Cash او BCH",
         Explain:`البيتكوين كاش Bitcoin  Cash او BCH هو عملة مشفرة منقسمة عن البيتكوين Bitcoin الكلاسيكي. البيتكوين كاش Bitcoin Cash او BCH تم إنشاؤه في أغسطس 2017. البيتكوين كاش Bitcoin Cash او BCH يزيد من حجم كتلة المعاملات، مما يسمح بمعالجة المزيد من المعاملات و الصفقات و التحويلات في وقت اقل و بحجم كتلة اكبر بخلاف Bitcoin.
         منذ إطلاقه البيتكوين Bitcoin كل يوم كان يتضاعف الضغط على البلوكشين الخاص به، الامر الذي يؤدي الي تباطئ التحقق من المعاملات و الامر الذي يزيد في رسوم التحويل لتكوين المعاملة دات اوليوية التحقق من قبل المعدنين. فإن حجم الكتل الذي يبلغ سعته 1 ميغابايت، أو 1000 بايت التي تم تحديدها في عام 2010. غالبا ما ستكون سبب إبطاء أوقات معالجة المعاملات، الامر الذي يحد من امكانية العملة و لا يجعلها مختلفة على التحويل العادي للأموال.
         البيتكوين كل يوم يكتسب شعبية كبيرة، فمن الالاف الذين عرفوا البيتكوين في السنوات الاولى، الان شعبية البيتكوين وصلت الى حد لا يمكن تصوره. و 1 MB في كتلة المعاملات لن تكون صالحة ابدا لشعبية البيتكوين. تم إضافة حد حجم الكتلة في كود البيتكوين من أجل منع هجمات البريد المزعج على الشبكة في وقت كانت قيمة البيتكوين منخفضة. وبحلول عام 2015، ارتفعت قيمة البيتكوين بشكل كبير وبلغ متوسط حجم الكتلة الى 600 بايت، مما خلق سيناريو أن تستغرق أوقات المعاملات تأخيرات حيث ان عدد الكتل يصل إلى أقصى قدرة و بهذا يجب التحقق من المعاملة في وقت قصير.
         كانت على مر سنين تطور البيتكوين عدد من الإقترحات لمعالجة المعاملات، وكثيرا ما ترتكز على زيادة حجم الكتلة. و لأن رمز البيتكوين لا تدار من قبل سلطة مركزية، تغييرات على التعليمات البرمجية تتطلب شراء كل السندات الموزعة للبيتكوين من المطورين و المعدنين. وهذا النهج القائم على توافق الآراء يمكن أن يؤدي إلى استغراق المقترحات وقتا طويلا.
         الامر الذي أدى إلى إنشاء مجموعات منفصلة لحسابا بلوكشين البيتكوين باستخدام معايير جديدة، و التي تسمى fork. فالعديد من forks، مثل Bitcoin XT و بيتكوين Bitcoin Unlimited، هذين الانقسامين او forks  فشلوا في اخد الموافقة من الجماهير بشكل كبير. ولكن البيتكوين كاش Bitcoin Cash او BCH الإنقسام الجديد لقي استحسان عدد كبير من المعدنين.
         
         <h4 style="line-height:1.5">البيتكوين كاش Bitcoin Cash او BCH</h4>
         البيتكوين كاش Bitcoin Cash او BCH يختلف عن بيتكوين الكلاسيكي في أنه يزيد من حجم الكتلة من 1 ميغابايت إلى 8 ميغابايت. كما أنه يزيل  Segregated Witness  او SegWit، والتعديل في الكود المقترحة، تهدف إلى تحرير مساحة الكتلة عن طريق إزالة أجزاء معينة من الصفقة. الهدف من Bitcoin Cash او BCH هو زيادة عدد المعاملات في الكتلة التي يمكن معالجتها من قبل المعدنين، ويأمل المؤيدون أن هذا التغيير سوف يسمح ل البيتكوين كاش Bitcoin Cash او BCH بالتنافس مع حجم المعاملات التي تكوين في باي بال وفيزا و يمكن التعامل معها عن طريق زيادة حجم الكتل.
         ولأن الطاقة الحاسوبية المطلوبة لمعالجة الكتل الأكبر حجما لايمكن ان يساهم فيها المعدنين اصحاب الحواسيب بقوة صغيرة، فإن النقاد يقلقون من أن تبني نهج البيتكوين كاش Bitcoin Cash او BCH سيؤدي إلى تركيز السلطة في أيدي الشركات التي يمكنها تحمل تكاليف معدات أكثر وأفضل. معارضو fork قلقون من أن هذا سيهدد النهج القائم على الإجماع تجاه البيتكوين، حيث أن عددا قليلا من الشركات يمكن أن تتتحكم في البيتكوين الامر الذي سيجبر المجتمع على العديد من التغيرات المحتملة في المستقبل.
         يستلزم hard fork الناجح ل البيتكوين كاش Bitcoin Cash او BCH البقاء على هذا النجاح لفترة طويلة بما فيه الكفاية لإغراء الأفراد والشركات لاستخدام و تعدين العملة الرقمية الجديدة البيتكوين كاش Bitcoin Cash او BCH فكلما زادت شعبية البيتكوين كاش Bitcoin Cash او BCH سيصل يوما الى الكتلة الحرجة. وبمجرد الوصول إلى تلك النقطة، نجاح البيتكوين كاش Bitcoin Cash او BCH ستدفع الآخرين لتطوير عملات بديلة خاصة بهم، والتي من شأنها أن تضع نفس الضغط على البيتكوين كاش Bitcoin Cash او BCH كما وضعت على البيتكوين الكلاسيكي. و لتفادي ما حصل مع البيتكوين الاصلي، المطورين قاموا بزيادة حجم الكتلة وتحسين معالجة المعاملات و جعلها اكثر سرعة.
         `,
         image_url:"images/BitcoinCash.png"
     }
 ]






 function displayInfo(){
     let str="";
    
    for(let i = 0 ; i < curranyInfo.length ; i++){

    divContentArray[i].addEventListener("click",function(){
        str= `
       
        <img class="w-100 pb-3" src="${curranyInfo[i].image_url}">
        <h1 style="Line-height:2">${curranyInfo[i].defenation}</h1>
        <p>${curranyInfo[i].Explain}</p>
    `
    document.getElementById("exampleModalLabel").innerHTML=curranyInfo[i].nameid;
    document.getElementById("DC-info").innerHTML = str;

    })
     
 }}
//  let navBar=document.getElementById("navbar");
//  let navBrand=document.getElementById("xnav");
//  let navItems=document.getElementsByClassName("nav-link");
//  let navArray=[...navItems];
 
//  function navDisplay(){
     
    
 
//      if(document.documentElement.scrollTop>500){
 
        
//         navBar.classList.add("bg-light");

       
 
//         for(let i=0 ; i<navArray.length;i++){
//          navArray[i].classList.remove("text-warinng");
//          navArray[i].classList.add("text-dark");
        
//   ;
  
//      }
         
 
//      }
     
//  }
 
 
//  window.addEventListener("scroll",navDisplay)
 
 